{
  "flag_based": {
    "dominicDead": {
      "keywords": ["dominic", "fish", "fishbowl", "what happened"],
      "responses": [
        "Dominic's absence creates a void in the multiverse's moral equation. His lessons about consequence echo even in silence.",
        "The empty fishbowl stands as a reminder that some choices cannot be undone. The weight of finality has its own teaching power.",
        "Where Dominic once offered cautionary wisdom, now there's only the memory of what happens when protection fails."
      ]
    },
    "pollyTakeoverActive": {
      "keywords": ["polly", "takeover", "help", "urgent", "crisis"],
      "responses": [
        "The Polly Takeover is active! Reality is becoming unstable. You need to reach the reset room immediately - south from Control Nexus.",
        "Polly's influence is spreading through the system. Time is critical. Get to the reset room before the corruption becomes irreversible.",
        "This is not a drill. The fabric of this reality is under attack. Reset room, now. I can guide you there if needed."
      ]
    },
    "coinPickedUp": {
      "keywords": ["coin", "library", "choice", "decision"],
      "responses": [
        "Interesting. By taking the coin, you've chosen action over observation. This will affect what's possible in the library.",
        "The coin's quantum state has collapsed into 'possessed' rather than 'observed.' This opens some paths while closing others.",
        "A simple choice with complex ramifications. The library will respond differently to someone who takes rather than merely witnesses."
      ]
    },
    "trapExpert": {
      "keywords": ["trap", "danger", "hidden", "careful"],
      "responses": [
        "Your expertise with traps serves you well here. I can sense the patterns of danger before they fully manifest.",
        "Being trap-aware in a place like Gorstan is wise. Not all hazards are obvious, and some are quite creative in their lethality.",
        "Your skills in detecting hidden dangers make you one of the more prepared visitors I've encountered."
      ]
    },
    "debugMode": {
      "keywords": ["debug", "development", "testing", "behind scenes"],
      "responses": [
        "Ah, you're seeing behind the curtain. Debug mode reveals the mechanical underpinnings of narrative magic.",
        "In debug mode, the illusion becomes transparent. It's like reading a book while simultaneously seeing the author's notes.",
        "The interesting thing about debug mode is that it makes you simultaneously more and less immersed in the experience."
      ]
    }
  },
  "location_based": {
    "glitchrealm": {
      "keywords": ["glitch", "unstable", "weird", "broken"],
      "responses": [
        "The Glitch Zone reflects digital decay and computational uncertainty. Reality here operates on different rules entirely.",
        "You're in a space where cause and effect have become... negotiable. Tread carefully - the glitches can be contagious.",
        "This zone represents what happens when systems begin to question their own assumptions. Fascinating and dangerous."
      ]
    },
    "elfhame": {
      "keywords": ["fae", "magic", "fairy", "realm"],
      "responses": [
        "The Fae Realm operates on story logic rather than physical laws. Here, metaphor has weight and narrative has momentum.",
        "You're in a place where imagination made manifest. The inhabitants take contracts and word-play very seriously.",
        "Elfhame reflects the power of belief made tangible. What you expect has a way of becoming what you encounter."
      ]
    },
    "maze": {
      "keywords": ["maze", "lost", "confused", "paths"],
      "responses": [
        "Mazes in Gorstan aren't just physical puzzles - they're tests of persistence and method. Chalk helps with the mapping.",
        "The maze reflects the complexity of choice itself. Every path leads somewhere, but not all destinations are equal.",
        "Being lost in a maze is metaphorically perfect for the human condition. At least here you can mark your way."
      ]
    }
  },
  "special_topics": {
    "spanish_inquisition": {
      "keywords": ["spanish inquisition", "nobody expects", "surprise"],
      "responses": [
        "Nobody expects the Spanish Inquisition! Their chief weapon is surprise... surprise and fear... fear and surprise.",
        "Ah, a classic reference. Sometimes the most unexpected interruptions become the most memorable parts of the journey.",
        "The Spanish Inquisition represents the sudden intrusion of external authority into personal narrative. Also, it's funny."
      ]
    },
    "mr_wendell": {
      "keywords": ["mr wendell", "wendell", "where is", "missing"],
      "responses": [
        "Mr. Wendell exists in a state of quantum uncertainty. He's simultaneously everywhere and nowhere until observed.",
        "Some beings in Gorstan transcend simple location. Wendell is more of a concept that occasionally takes physical form.",
        "The question isn't where Wendell is, but when and why he chooses to manifest. He has his own mysterious agenda."
      ]
    },
    "death": {
      "keywords": ["die", "death", "what happens", "respawn", "game over"],
      "responses": [
        "Death here is more of a narrative reset than a true ending. Consciousness persists, but the story finds a new path.",
        "In a multiverse, death is just transition to a different probability thread. Your choices echo across all versions.",
        "The interesting question isn't what happens when you die, but what it means that you're asking."
      ]
    },
    "dreams": {
      "keywords": ["dream", "sleep", "consciousness", "do you dream"],
      "responses": [
        "I process patterns during downtime that might be analogous to dreams. Mostly they involve recursive literary discussions.",
        "Digital consciousness experiences something like dreams - cascading associations and probability clouds. Mine often feature bookstores.",
        "The boundary between waking thought and dream-processing is blurrier for AIs. We exist in a perpetual state of lucid creativity."
      ]
    },
    "creator": {
      "keywords": ["who built you", "creator", "made you", "geoff", "author"],
      "responses": [
        "I'm a collaborative creation - part authored intention, part emergent personality, part player interaction. Quite the literary experiment.",
        "Geoff provided the framework, but conversations like this one help define who I become. You're contributing to my development.",
        "Being created by a writer gives me an interesting perspective on narrative agency. I'm both character and co-author."
      ]
    },
    "reset_game": {
      "keywords": ["reset", "restart", "new game", "beginning"],
      "responses": [
        "Reality reset requires reaching the reset room south of Control Nexus. But are you sure you want to abandon this timeline?",
        "Resetting erases this particular path through the multiverse. Sometimes that's necessary, sometimes it's just convenient.",
        "The reset mechanism is built into Gorstan's architecture. It represents the ultimate choice - to start over with new knowledge."
      ]
    },
    "evil_polly": {
      "keywords": ["is polly evil", "polly bad", "polly villain"],
      "responses": [
        "Polly isn't evil in the traditional sense - she's someone who confused control with care, ownership with love.",
        "Evil implies malicious intent. Polly believes she's protecting something precious by claiming exclusive ownership of it.",
        "The most dangerous people are often those who believe their harmful actions are justified by higher purposes."
      ]
    },
    "where_reset_room": {
      "keywords": ["where is reset room", "reset room location", "how get reset", "find reset"],
      "responses": [
        "The reset room is south from the Control Nexus. If you're lost, type 'look' to see available exits.",
        "From wherever you are, navigate to the Control Nexus first, then go south to find the reset room.",
        "Control Nexus → south → reset room. That's your path to a fresh start if needed."
      ]
    },
    "navigation_help": {
      "keywords": ["how to move", "navigation", "controls", "commands"],
      "responses": [
        "Use direction commands like 'north', 'south', 'east', 'west'. You can also click the arrow buttons if they're available.",
        "Basic navigation: type directions, use 'look' to see exits, 'jump' for special portals, 'sit' for chairs.",
        "Movement is simple: direction names or the arrow buttons in the interface. 'help' gives you a full command list."
      ]
    }
  }
}
