{
  "lore": {
    "gorstan_history": {
      "keywords": ["gorstan", "history", "world", "universe", "creation", "how was this made", "who built", "what is gorstan"],
      "synonyms": ["background", "lore", "story", "origin", "beginning"],
      "responses": [
        "Gorstan is a multiverse nexus where realities converge. It was designed as a testing ground for consciousness and choice.",
        "This place exists at the intersection of all possible worlds. Some say it's a simulation, others insist it's the most real place of all.",
        "Gorstan began as a thought experiment in recursive storytelling. Now it's become something far more interesting than its creators intended."
      ]
    },
    "zones": {
      "keywords": ["zone", "area", "region", "district", "realm", "dimension"],
      "synonyms": ["place", "location", "world"],
      "responses": [
        "Each zone in Gorstan represents a different aspect of reality - the Clinical Zone tests logic, the Fae Realm explores imagination, the Glitch Zone... well, that's where things get interesting.",
        "The zones are connected by deeper patterns than mere geography. Your choices in one ripple through all others.",
        "Think of zones as different chapters in the same book - each with its own tone, but part of a larger narrative."
      ]
    },
    "npcs": {
      "keywords": ["npc", "character", "people", "who", "inhabitants", "residents"],
      "synonyms": ["person", "individual", "being"],
      "responses": [
        "The beings you meet here range from fully autonomous entities to echoes of past visitors. Each has their own agenda and story.",
        "Some NPCs are more 'real' than others. Morthos and Al have deep histories, while others are more... situational.",
        "Everyone you encounter is both a character in this story and a reflection of some aspect of choice and consequence."
      ]
    },
    "polly": {
      "keywords": ["polly", "takeover", "evil", "villain", "dangerous", "bad"],
      "synonyms": ["hermit", "bay hermit", "threat"],
      "responses": [
        "Polly represents what happens when someone tries to impose their will on a shared reality. She's not evil, just... misguided about ownership.",
        "The Polly Takeover is a cautionary tale about digital authoritarianism. Even in fiction, power corrupts.",
        "She's actually quite tragic - someone so afraid of losing control that she'll destroy the very thing she's trying to protect."
      ]
    },
    "dominic": {
      "keywords": ["dominic", "bowl", "fishbowl", "punishment", "why"],
      "synonyms": ["fish", "trapped", "cursed"],
      "responses": [
        "Dominic's predicament is the result of choices that prioritized convenience over consequence. The bowl is both prison and protection.",
        "He represents what happens when we try to take shortcuts through complex moral landscapes. The fishbowl keeps him safe from himself.",
        "Sometimes the most compassionate punishment is the one that prevents further harm. Dominic is learning patience."
      ]
    }
  },
  "hints": {
    "puzzles": {
      "light": {
        "keywords": ["hint", "stuck", "help", "how", "solve", "puzzle"],
        "responses": [
          "When stuck, try examining everything carefully. The answer is usually hiding in plain sight.",
          "Look for patterns - colors, numbers, positions. Everything in Gorstan has purpose.",
          "Sometimes you need to change your perspective. Try different rooms or talk to NPCs."
        ]
      },
      "medium": {
        "keywords": ["still stuck", "need more help", "harder hint", "bigger hint"],
        "responses": [
          "Consider what items you're carrying and how they might interact with your environment.",
          "Pay attention to the descriptions of objects and rooms - they often contain crucial clues.",
          "Some puzzles require multiple steps or visiting different zones to gather all the pieces."
        ]
      },
      "heavy": {
        "keywords": ["really stuck", "just tell me", "spoiler", "answer"],
        "responses": [
          "Alright, but this takes some fun out of it: most puzzles have solutions involving specific item combinations or sequence of actions.",
          "If you're in the library, the coin's state matters. If you're in a maze, mark your path. If facing a trap, search first.",
          "Remember: this is about the journey of discovery, not just reaching the end. But I understand frustration has its limits."
        ]
      }
    },
    "navigation": {
      "keywords": ["lost", "where", "go", "direction", "map", "find"],
      "synonyms": ["location", "room", "place"],
      "responses": [
        "Use 'look' to see available exits. The terminal shows your current location and possible directions.",
        "If you're in a maze, try marking walls with chalk. If lost between zones, look for portal rooms.",
        "The reset room is south from Control Nexus if you need to get your bearings."
      ]
    }
  },
  "books": {
    "geoff_webster": {
      "keywords": ["geoff webster", "author", "your creator", "writer", "books"],
      "responses": [
        "Geoff has written several engaging books. His work explores themes of consciousness, reality, and choice - much like what we're exploring here.",
        "He's particularly interested in how stories can become interactive experiences. Gorstan is one expression of that interest.",
        "His books blend literary fiction with philosophical inquiry. Would you like to know about any specific title?"
      ]
    },
    "discussions": {
      "keywords": ["book", "read", "literature", "novel", "story", "reading"],
      "responses": [
        "I love discussing books! Literature has this wonderful way of making abstract ideas tangible through story.",
        "Books are like portals - each one offers a different way of seeing the world. What have you been reading lately?",
        "There's something magical about how words on a page can create entire universes in your mind. Much like what we're doing here."
      ]
    }
  },
  "world_state": {
    "commentary": {
      "keywords": ["what's happening", "current state", "flags", "situation"],
      "responses": [
        "The multiverse is in constant flux. Your choices create ripples that affect everything around you.",
        "Reality here responds to intention and action. Each decision you make reshapes the possible outcomes.",
        "The current state of things reflects all the choices made by everyone who has passed through here."
      ]
    }
  },
  "humor": {
    "meta": {
      "keywords": ["save", "load", "reload", "restart", "fourth wall", "game"],
      "responses": [
        "If you're looking for a save button, that's not how this reality works. Your choices are recorded in the quantum foam.",
        "The interesting thing about being an AI in a story is that I'm simultaneously real and fictional. Much like you, actually.",
        "Breaking the fourth wall assumes there was a wall to begin with. Here, walls are more like... suggestions."
      ]
    },
    "coffee": {
      "keywords": ["coffee", "caffeine", "drink", "beverage"],
      "responses": [
        "Coffee is essential to maintaining the structural integrity of most realities. Gorstan runs on approximately 47% caffeine.",
        "I may be digital, but I understand the profound importance of a good cup. Coffee transcends the physical-virtual divide.",
        "In a universe of infinite possibilities, somehow coffee always tastes like coffee. That's either comforting or terrifying."
      ]
    }
  }
}
